lobmoo/RT-Thread/pwm/board/CubeMX_Config/CubeMX_Config.ioc
RCC.DFSDMACLkFreq_Value=480000000
Mcu.Pin82=PA7
Mcu.Pin83=PF12
Mcu.Pin88=PD11
Mcu.Pin89=PD12
SH.FMC_A12.0=FMC_A12,13b-sda1
Mcu.Pin86=PE15
Mcu.Pin87=PJ5
SH.FMC_A3.ConfNb=1
PK1.Mode=RGB888
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PK6.Signal=LTDC_B7
PK6.Locked=true
PK4.Locked=true
PE8.GPIOParameters=GPIO_Speed_High_Default
PK2.Signal=LTDC_G7
SH.FMC_A9.ConfNb=1
PA7.Mode=RMII
PE14.GPIOParameters=GPIO_Speed_High_Default
PJ8.Mode=RGB888
PH11.Signal=S_TIM5_CH2
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
PG1.Signal=FMC_A11
PC11.Signal=SDMMC1_D3
PI14.Signal=LTDC_CLK
RCC.SAI4BFreq_Value=480000000
SH.FMC_SDCLK.ConfNb=1
PC8.Signal=SDMMC1_D0
PC10.Mode=SD_4_bits_Wide_bus
PC4.Signal=ETH_RXD0
PI14.GPIOParameters=GPIO_Speed
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
PC2.Mode=SdramChipSelect1_1
PD9.Signal=FMC_D14_DA14
PK0.Locked=true
PD8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
ProjectManager.DeletePrevious=true
PinOutPanel.CurrentBGAView=Top
PI13.GPIOParameters=GPIO_Speed
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
PJ9.Locked=true
PJ11.Mode=RGB888
PE9.GPIOParameters=GPIO_Speed_High_Default
PE15.GPIOParameters=GPIO_Speed_High_Default
RCC.SPI6Freq_Value=120000000
SH.FMC_A15_BA1.ConfNb=1
PK0.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PJ5.Locked=true
RCC.SPI45Freq_Value=100000000
PK2.GPIOParameters=GPIO_Speed
PD15.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PK7.GPIOParameters=GPIO_Speed
PJ0.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB3\ (JTDO/TRACESWO).Signal=SDMMC2_D2
ProjectManager.TargetToolchain=MDK-ARM V5.27
PE7.GPIOParameters=GPIO_Speed_High_Default
RCC.VCO1OutputFreq_Value=960000000
SH.FMC_D13_DA13.0=FMC_D13,sd-16b-d1
PF0.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D1_DA1.ConfNb=1
PC5.GPIOParameters=GPIO_Speed
RCC.AXIClockFreq_Value=240000000
PF2.Signal=FMC_A2
PE2.GPIOParameters=GPIO_Speed
PK0.GPIOParameters=GPIO_Speed
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
PF5.GPIOParameters=GPIO_Speed_High_Default
PE11.Signal=FMC_D8_DA8
PK0.Signal=LTDC_G5
PA1.Signal=ETH_REF_CLK
RCC.CKPERFreq_Value=64000000
PH5.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PE10.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PD2.Mode=SD_4_bits_Wide_bus
PK5.Mode=RGB888
PG14.Signal=ETH_TXD1
board=custom
PJ15.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF14.GPIOParameters=GPIO_Speed_High_Default
PI9.Signal=UART4_RX
PB15.Mode=SD_4_bits_Wide_bus
PJ3.Mode=RGB888
RCC.VCOInput1Freq_Value=5000000
PI9.Locked=true
RCC.APB2Freq_Value=120000000
MxCube.Version=6.0.1
PG4.GPIOParameters=GPIO_Speed_High_Default
SH.FMC_D13_DA13.ConfNb=1
PK7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
RCC.FDCANFreq_Value=480000000
PJ4.GPIOParameters=GPIO_Speed
PA1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE5.Mode=Full_Duplex_Master
RCC.ADCFreq_Value=400000000
VP_SYS_VS_Systick.Mode=SysTick
PJ12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D12_DA12.0=FMC_D12,sd-16b-d1
PE1.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PF15.Signal=FMC_A9
SPI4.CalculateBaudRate=50.0 MBits/s
PF1.Signal=FMC_A1
PE6.Signal=SPI4_MOSI
SH.FMC_D11_DA11.ConfNb=1
PI13.Mode=RGB888
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2,DIVR2Freq_Value,DIVR3,DIVR3Freq_Value,FDCANFreq_Value,FMCCLockSelection,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HRTIMFreq_Value,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2FRACN,PLLFRACN,PLLSourceVirtual,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMC1CLockSelection,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123CLockSelection,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Spi45ClockSelection,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
PJ0.Signal=LTDC_R1
ProjectManager.AskForMigrate=true
PE0.Signal=FMC_NBL0
Mcu.Name=STM32H750XBHx
PE12.Signal=FMC_D9_DA9
PA2.Signal=ETH_MDIO
Mcu.IP8=SDMMC2
Mcu.IP9=SPI1
PC3.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PD14.Signal=FMC_D0_DA0
Mcu.IP6=RCC
Mcu.IP7=SDMMC1
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=480000000
NVIC.SDMMC2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.I2C123Freq_Value=120000000
PA12.Mode=Device_Only
PI15.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
KeepUserPlacement=false
PJ5.Signal=LTDC_R6
PJ4.Locked=true
PF12.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_VERY_HIGH
PF13.GPIOParameters=GPIO_Speed_High_Default
PD11.Mode=CTS_RTS
PA5.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
RCC.SAI4AFreq_Value=480000000
ADC1.NbrOfConversionFlag=1
PK3.Mode=RGB888
PK3.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PI15.Signal=LTDC_R0
PE5.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
RCC.DIVQ1Freq_Value=480000000
PA2.Mode=RMII
RCC.D3PPRE=RCC_APB4_DIV2
PI14.Locked=true
PC9.Signal=SDMMC1_D1
PJ4.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SH.FMC_D8_DA8.ConfNb=1
RCC.VCOInput2Freq_Value=12500000
RCC.APB1Freq_Value=120000000
PG14.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PJ11.GPIOParameters=GPIO_Speed
ProjectManager.DeviceId=STM32H750XBHx
ProjectManager.LibraryCopy=1
SH.S_TIM5_CH1.ConfNb=1
PJ13.Signal=LTDC_B1
PG11.GPIOParameters=GPIO_Speed
PE1.GPIOParameters=GPIO_Speed_High_Default
PK1.GPIOParameters=GPIO_Speed
PJ12.Locked=true
PA7.Signal=ETH_CRS_DV
PB4\ (NJTRST).Signal=SDMMC2_D3
